In [1]:
import pandas as pd

In [2]:
bank_users = pd.read_csv("data/bank_users.csv")
bank_users.head(3)

,first_name,last_name,email,bank_account,born_year,city
0,Shawn,Gotts,sgotts0@newsvine.com,58.0,NaN,Jinchuan
1,Sergeant,Linsey,slinsey1@qq.com,70.0,2007.0,Tāngāil
2,Ambrosio,Gorton,agorton2@google.es,48.0,2000.0,Zhushan Chengguanzhen

In [4]:
bank_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    200 non-null    object
 1   last_name     200 non-null    object
 2   email         192 non-null    object
 3   bank_account  179 non-null    float64
 4   born_year     176 non-null    float64
 5   city          187 non-null    object
dtypes: float64(2), object(4)
memory usage: 9.5+ KB

In [6]:
clean_data = bank_users.dropna()
clean_data

,first_name,last_name,email,bank_account,born_year,city
1,Sergeant,Linsey,slinsey1@qq.com,70.0,2007.0,Tāngāil
2,Ambrosio,Gorton,agorton2@google.es,48.0,2000.0,Zhushan Chengguanzhen
3,Gram,Steanyng,gsteanyng3@google.fr,92.0,1970.0,Hongxing
4,Britt,Cockaday,bcockaday4@t.co,78.0,1985.0,Nangabulik
5,Onfroi,Simonett,osimonett5@businessinsider.com,58.0,1990.0,Qingxi
...,...,...,...,...,...,...
193,Perle,Gavrielly,pgavrielly5d@123-reg.co.uk,56.0,2008.0,Santa Fe de la Vera Cruz
194,Brennan,Stow,bstow5e@w3.org,29.0,1976.0,Psary
195,Franz,Oppy,foppy5f@shutterfly.com,90.0,2020.0,Bílina Kyselka
196,Adolphus,Labbati,alabbati5g@yellowbook.com,56.0,1984.0,Berlin
198,Armstrong,Laughren,alaughren5i@yahoo.co.jp,87.0,1983.0,Detik Satu

In [8]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 140 entries, 1 to 198
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    140 non-null    object
 1   last_name     140 non-null    object
 2   email         140 non-null    object
 3   bank_account  140 non-null    float64
 4   born_year     140 non-null    float64
 5   city          140 non-null    object
dtypes: float64(2), object(4)
memory usage: 7.7+ KB

In [12]:
clean_data_2 = bank_users.dropna(how="any")
clean_data_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 140 entries, 1 to 198
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    140 non-null    object
 1   last_name     140 non-null    object
 2   email         140 non-null    object
 3   bank_account  140 non-null    float64
 4   born_year     140 non-null    float64
 5   city          140 non-null    object
dtypes: float64(2), object(4)
memory usage: 7.7+ KB

In [13]:
clean_data_3 = bank_users.dropna(how="all")
clean_data_3

,first_name,last_name,email,bank_account,born_year,city
0,Shawn,Gotts,sgotts0@newsvine.com,58.0,NaN,Jinchuan
1,Sergeant,Linsey,slinsey1@qq.com,70.0,2007.0,Tāngāil
2,Ambrosio,Gorton,agorton2@google.es,48.0,2000.0,Zhushan Chengguanzhen
3,Gram,Steanyng,gsteanyng3@google.fr,92.0,1970.0,Hongxing
4,Britt,Cockaday,bcockaday4@t.co,78.0,1985.0,Nangabulik
...,...,...,...,...,...,...
195,Franz,Oppy,foppy5f@shutterfly.com,90.0,2020.0,Bílina Kyselka
196,Adolphus,Labbati,alabbati5g@yellowbook.com,56.0,1984.0,Berlin
197,Aurelea,Cordery,acordery5h@furl.net,NaN,1992.0,Veshnyaki
198,Armstrong,Laughren,alaughren5i@yahoo.co.jp,87.0,1983.0,Detik Satu
199,Henrietta,Peckitt,hpeckitt5j@multiply.com,NaN,1967.0,Phú Lộc

In [17]:
clean_data_4 = bank_users.dropna(subset=["born_year"])
clean_data_4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 176 entries, 1 to 199
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    176 non-null    object
 1   last_name     176 non-null    object
 2   email         168 non-null    object
 3   bank_account  157 non-null    float64
 4   born_year     176 non-null    float64
 5   city          165 non-null    object
dtypes: float64(2), object(4)
memory usage: 9.6+ KB

In [20]:
clean_data_5 = bank_users.dropna(subset=["bank_account", "born_year"])
clean_data_5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 157 entries, 1 to 198
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    157 non-null    object
 1   last_name     157 non-null    object
 2   email         149 non-null    object
 3   bank_account  157 non-null    float64
 4   born_year     157 non-null    float64
 5   city          147 non-null    object
dtypes: float64(2), object(4)
memory usage: 8.6+ KB

In [21]:
bank_users.size

1200

In [24]:
bank_users.dropna().size

840

In [26]:
bank_users.size - bank_users.dropna().size

360

In [27]:
bank_users.dropna(subset=["born_year"]).size

1056

In [29]:
bank_users.size - bank_users.dropna(subset=["born_year"]).size

144

In [30]:
bank_users.dropna(subset=["email"]).size

1152

In [33]:
bank_users.size - bank_users.dropna(subset=["email"]).size

48

In [36]:
48/6        # počet chybějících hodnot v mailech - protože to vždy odstraní 6 buněk s celým řádkem

8.0

Dotaz, kolik je chybějících hodnot ve sloupci "bank_account" a zároveň ve sloupci "born_year"?

In [44]:
bank_users.size # 1200
bank_users.size - bank_users.dropna(subset=["bank_account"]).size # 126 odstranil buněk
bank_users.size - bank_users.dropna(subset=["born_year"]).size # 144 odstranil buněk
bank_users.size - bank_users.dropna(subset=["bank_account", "born_year"]).size # odstranil 258 buněk

258

In [46]:
126 + 144
270 - 258

12

In [47]:
12 / 6

2.0